{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"Mes photos","text":"Thaïlande","link":"/myimages/index.html"},{"title":"Resume","text":"Attached here, my resume in english and french English French","link":"/resume/index.html"}],"posts":[{"title":"","text":"Artificial Intelligence in Journalism : from Sci-Fi to the real worldTwo millions. This is the number of articles, newspapers and blog posts on a daily basis accross the world. Everyday, there are more and more contents on the Internet, from a simple individual post to a worldwide article about Trump’s last mood. In the writing process, thousands of journalists are using their best ideas to create the perfect mixup. Their goal is not only to inform the reader but also to maintain his attention to generate profits. For some articles, these journalists need assistants, searching and indexing loads of external links (articles, wikipedia …) to create cross references (articles from the same website for web traffic) or verify facts. But nowadays, a lot of journalism work can be automated, thus helping journalists to focus on the facts that matter and delegate repetitive workflows. A real life application already in placeIt’s called automated journalism and reunites the algorithms and technics used by many journalists and reporters to produce the news we read everyday. For example, an intelligent software can scan two hundred articles about a specific subject and output the main topics and information about them. The journalist’s tasks are simplified, leaving time for creative writing. A team of journalists and engineers made an algorithm and found out that the robot was 99% reliable in making automated news report.https://www.equaltimes.org/how-artificial-intelligence-is?lang=en This means that we can already use computing and algorithms to generate repetitive tasks which take about two hours for a human and two minutes for a computer. In a close future, we could have a robot advising articles, relating topics or comparing the press live trends to know which topic should be treated first. Could it be a threat ?Whitout talking about employment problems, the automated journalism can lead to the issue of authorship. Imagine in five years if a robot could create an article from scratch, searching for related articles, giving the facts, making charts and external links. After a simple reading by a human, the article could be published. So who would be the author ? The programmer of the software ? The robot himself ? The human because he accepted the article ? Some people are also concerned about the credibility of those articles. Almost all the articles we read everyday have a political line, meaning the author or the newspapaer is either from right, left, or center. With a robot programmed to check facts only, keep away trash talking or accusation of political figure last decisions, what will be the consequences on the articles ? It could be boring, without perspective articles. FutureSome people consider automated journalism as a way of winning time and leaving the creative work for real journalists. Another part of the press world think this will lower the level of journalism by bringing non objective articles and fact-only posts, breaking the main ideas behind journalism, humanism. To finish, we can imagine that in about five years, with the advance of technology, robots will have sufficient “personnality” to correct the problem of objectivity and will be capable of writing a whole story with a political line. “Those who can imagine anything, can create the impossible.” Alan Turing","link":"/2019/02/03/Journalism/"},{"title":"Hello","text":"This is my first article on this website using Hexo.","link":"/2019/01/28/Hello/"},{"title":"","text":"The shoutbox, a new inventionHere is a pdf of our kickstarter shoutbox presentation. Feel free to comment about it or send my an email","link":"/2019/02/12/Shoutbox/"}],"tags":[],"categories":[]}